src/Catalogs/рмкТочкиПодключения/рмкТочкиПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкТочкиПодключения</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерКонвертации</name>
    <type>
      <types>EnumRef.рмкМенеджерыКонвертации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетодаКонвертации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнформации</name>
    <type>
      <types>EnumRef.рмкТипыПередаваемойИнформации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МетаданныеДляРепликации</name>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/рмкОбщегоНазначенияПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция МетаданныеДоступныеДляРепликации() Экспорт
	
	МассивИменМетаданных = Новый Массив;
	
	ЗаполнитьИменаМетаданныхКоллекцииВМассиве(Метаданные.Справочники, 		МассивИменМетаданных);
	ЗаполнитьИменаМетаданныхКоллекцииВМассиве(Метаданные.Документы, 		МассивИменМетаданных);
	ЗаполнитьИменаМетаданныхКоллекцииВМассиве(Метаданные.ПланыВидовХарактеристик, МассивИменМетаданных);
	ЗаполнитьИменаМетаданныхКоллекцииВМассиве(Метаданные.ПланыВидовРасчета, МассивИменМетаданных);
	ЗаполнитьИменаМетаданныхКоллекцииВМассиве(Метаданные.ПланыСчетов, 		МассивИменМетаданных);
	ЗаполнитьИменаМетаданныхКоллекцииВМассиве(Метаданные.РегистрыСведений, 	МассивИменМетаданных);
	ЗаполнитьИменаМетаданныхКоллекцииВМассиве(Метаданные.РегистрыНакопления,МассивИменМетаданных);  
	
	Для Каждого МетаданныеИсключения Из Метаданные.Подсистемы.рмкRMQConnector.Состав Цикл
		
		ИндексЭлемента = МассивИменМетаданных.Найти(МетаданныеИсключения.ПолноеИмя());
		
		Если ИндексЭлемента <> Неопределено Тогда
			МассивИменМетаданных.Удалить(ИндексЭлемента);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат МассивИменМетаданных;
	
КонецФункции

Функция ПолучитьДоступныеВерсииКомпонентыRQM() Экспорт
	
	ИменаМакетов = Новый Массив;
	
	Для Каждого ЭлементМетаданных Из Метаданные.Подсистемы.рмкRMQConnector.Состав Цикл
		
		Если Метаданные.ОбщиеМакеты.Содержит(ЭлементМетаданных) И СтрНайти(ЭлементМетаданных.Имя, "PinkRabbitMQ") Тогда
			ИменаМакетов.Добавить(ЭлементМетаданных.Имя);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат ИменаМакетов;
	
КонецФункции	

Функция ПолучитьВерсиюКомпонентыRQM() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ВерсияКомпоненты = Константы.рмкВерсияКомпоненты.Получить();
	
	Если ПустаяСтрока(ВерсияКомпоненты) Тогда
		
		ВерсииКомпоненты = ПолучитьДоступныеВерсииКомпонентыRQM();
		ВерсияКомпоненты = ВерсииКомпоненты[0];
		
	КонецЕсли;	
	
	Возврат ВерсияКомпоненты;	
	
КонецФункции

Функция ТочкаПодключенияПоИмени(ИмяТочки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Справочники.рмкТочкиПодключения.НайтиПоРеквизиту("ИмяДляРазработчика", ИмяТочки);
	
КонецФункции	

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИменаМетаданныхКоллекцииВМассиве(КоллекцияМетаданных, МассивИменМетаданных)
	
	Для Каждого МетаданныеОбъекта Из КоллекцияМетаданных Цикл
		МассивИменМетаданных.Добавить(МетаданныеОбъекта.ПолноеИмя());
	КонецЦикла;
	
КонецПроцедуры		

#КонецОбласти
